<a href="https://colab.research.google.com/github/SaiDhanyaa/WORK-OUTS/blob/main/MOVIE_RECOMMENDATION_ENGINE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [39]:
import pandas as pd
import numpy as np

In [40]:
movie=pd.read_csv("/content/Movie.csv")

In [41]:
movie[0:5]

   userId             movie  rating
0       3  Toy Story (1995)     4.0
1       6  Toy Story (1995)     5.0
2       8  Toy Story (1995)     4.0
3      10  Toy Story (1995)     4.0
4      11  Toy Story (1995)     4.5

In [42]:
###no of unique users in the data sets
len(movie.userId.unique())

4081

In [44]:
###no of unique movies in the dataset
len(movie.movie.unique())

10

In [45]:
###convert the long table into the wider table
movie_wide=movie.pivot(index='userId',
                       columns='movie',
                       values='rating').reset_index(drop=True)

In [ ]:
movie_wide

In [47]:
movie_wide.index=movie.userId.unique()

In [ ]:
movie_wide

In [50]:
####impute those NAN values with 0 values
movie_wide.fillna(0,inplace=True)

In [ ]:
movie_wide

In [53]:
### calculating the cosine based similarities
from sklearn.metrics import pairwise_distances
from scipy.spatial.distance import cosine,correlation

In [54]:
pairwise_dis= pairwise_distances(movie_wide.values, metric='cosine')

In [55]:
movie_simi=1-pairwise_dis

In [56]:
movie_simi

array([[1.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.55337157],
       [0.        , 1.        , 0.        , ..., 0.45883147, 0.        ,
        0.        ],
       [0.        , 0.        , 1.        , ..., 0.45883147, 1.        ,
        0.62254302],
       ...,
       [0.        , 0.45883147, 0.45883147, ..., 1.        , 0.45883147,
        0.47607054],
       [0.        , 0.        , 1.        , ..., 0.45883147, 1.        ,
        0.62254302],
       [0.55337157, 0.        , 0.62254302, ..., 0.47607054, 0.62254302,
        1.        ]])

In [57]:
##it is in array. so store it in the dataframe
movie_simi_df=pd.DataFrame(movie_simi)

In [59]:
movie_simi_df.head

<bound method NDFrame.head of           0         1         2     ...      4078      4079      4080
0     1.000000  0.000000  0.000000  ...  0.000000  0.000000  0.553372
1     0.000000  1.000000  0.000000  ...  0.458831  0.000000  0.000000
2     0.000000  0.000000  1.000000  ...  0.458831  1.000000  0.622543
3     0.000000  0.000000  0.000000  ...  0.619422  0.000000  0.000000
4     1.000000  0.000000  0.000000  ...  0.000000  0.000000  0.553372
...        ...       ...       ...  ...       ...       ...       ...
4076  0.000000  0.000000  0.000000  ...  0.000000  0.000000  0.000000
4077  0.000000  0.000000  0.752577  ...  0.345306  0.752577  0.468511
4078  0.000000  0.458831  0.458831  ...  1.000000  0.458831  0.476071
4079  0.000000  0.000000  1.000000  ...  0.458831  1.000000  0.622543
4080  0.553372  0.000000  0.622543  ...  0.476071  0.622543  1.000000

[4081 rows x 4081 columns]>

In [62]:
movie_simi_df.iloc[0:5,0:5]

     0    1    2    3    4
0  1.0  0.0  0.0  0.0  1.0
1  0.0  1.0  0.0  0.0  0.0
2  0.0  0.0  1.0  0.0  0.0
3  0.0  0.0  0.0  1.0  0.0
4  1.0  0.0  0.0  0.0  1.0

In [63]:
###set the insex and column names to userids
movie_simi_df.index=movie.userId.unique()
movie_simi_df.columns=movie.userId.unique()

In [64]:
movie_simi_df.iloc[0:5,0:5]

     3    6    8    10   11
3   1.0  0.0  0.0  0.0  1.0
6   0.0  1.0  0.0  0.0  0.0
8   0.0  0.0  1.0  0.0  0.0
10  0.0  0.0  0.0  1.0  0.0
11  1.0  0.0  0.0  0.0  1.0

In [67]:
#####the diagonal values are with high corelation, we have no use to have the similarities with same person. so make those diagonal values into 0
np.fill_diagonal(movie_simi,0)

In [69]:
movie_simi_df.iloc[0:5,0:5]

     3    6    8    10   11
3   0.0  0.0  0.0  0.0  1.0
6   0.0  0.0  0.0  0.0  0.0
8   0.0  0.0  0.0  0.0  0.0
10  0.0  0.0  0.0  0.0  0.0
11  1.0  0.0  0.0  0.0  0.0

In [71]:
######## HIGH SIMLARITY USERS
movie_simi_df.idxmax(axis=1)[0:5]

3       11
6      168
8       16
10    4047
11       3
dtype: int64

In [ ]:
###now to check what are all the movies these persons watches and recommend accordingly

In [73]:
movie[(movie['userId']==6)|(movie['userId']==168)]

      userId                    movie  rating
1          6         Toy Story (1995)     5.0
60       168         Toy Story (1995)     4.5
3725       6  Grumpier Old Men (1995)     3.0
6464       6           Sabrina (1995)     5.0

# ***BOTH HAVE WATCHED Toy Story (1995) , THE USERID6 HAVE WATCHED Grumpier Old Men (1995) AND Sabrina (1995) , SO, RECOMMEND MOVIE Sabrina (1995) TO USERID 168. BECAUSE ITS RATING IS HIGHER THAN Grumpier Old Men (1995)***

In [74]:
user_1=movie[movie['userId']==6]

In [75]:
user_2=movie[movie['userId']==11]

In [76]:
user_1

      userId                    movie  rating
1          6         Toy Story (1995)     5.0
3725       6  Grumpier Old Men (1995)     3.0
6464       6           Sabrina (1995)     5.0

In [77]:
user_2

      userId             movie  rating
4         11  Toy Story (1995)     4.5
7446      11  GoldenEye (1995)     2.5

In [78]:
user_1.movie

1              Toy Story (1995)
3725    Grumpier Old Men (1995)
6464             Sabrina (1995)
Name: movie, dtype: object

In [79]:
user_2.movie

4       Toy Story (1995)
7446    GoldenEye (1995)
Name: movie, dtype: object

In [80]:
###merge the user id to get to know the recommendation
pd.merge(user_1, user_2, on='movie', how='outer')

   userId_x                    movie  rating_x  userId_y  rating_y
0       6.0         Toy Story (1995)       5.0      11.0       4.5
1       6.0  Grumpier Old Men (1995)       3.0       NaN       NaN
2       6.0           Sabrina (1995)       5.0       NaN       NaN
3       NaN         GoldenEye (1995)       NaN      11.0       2.5

In [ ]:
## since with have watched the toy story(1995) we cannot recommend GoldenEye (1995) to userid 6 because of the low ratings .
### and we can recommend 	Sabrina (1995) to userid 11. we cannot recommend Grumpier Old Men (1995) to userid 11 because of the low rating.